be/bff/tests/load/baseline.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 30
      arrivalRate: 5
      name: "Warm up"
    - duration: 60
      arrivalRate: 20
      name: "Sustained load"
    - duration: 30
      arrivalRate: 50
      name: "Peak load"
    - duration: 30
      arrivalRate: 5
      name: "Cool down"
  processor: "./processor.js"

scenarios:
  - name: "Health Check"
    weight: 20
    flow:
      - get:
          url: "/api/v1/telemetry/health"
          expect:
            - statusCode: 200
            - contentType: json
            - hasProperty: status
  
  - name: "Service Info"
    weight: 10
    flow:
      - get:
          url: "/api/v1/telemetry/info"
          expect:
            - statusCode: 200
  
  - name: "Geocode Request"
    weight: 50
    flow:
      - post:
          url: "/api/v1/geocode"
          json:
            location: "{{ $randomLocation() }}"
          expect:
            - statusCode: 200
            - hasProperty: place
  
  - name: "Client Logging"
    weight: 20
    flow:
      - post:
          url: "/api/v1/telemetry/log"
          json:
            level: "info"
            message: "Load test log entry"
            meta:
              test: true
              timestamp: "{{ $timestamp }}"

# Performance thresholds
ensure:
  maxErrorRate: 1        # Max 1% error rate
  p95: 500              # 95th percentile response time < 500ms
  p99: 1000             # 99th percentile response time < 1000ms